In [35]:
##importtaaminen
import numpy as np
import pandas as pd
import matplotlib as mp
##datan lukeminen
df= pd.read_excel('../dataset/WorkPlaceSatisfactionSurveyData.xlsx')
##Datan siistintä
df.drop(['number', 'healtcare', 'holidayCabin', 'gym', 'muscleCare'], axis=1)
df.index #kertoo kuinka monta riviä datassa on. kyselyyn vastasi 82 henkilöä

,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks
0,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,1,24,1,2.0,4.0,2183,2,3.0,2,1,2
...,...,...,...,...,...,...,...,...,...,...,...
77,1,22,1,3.0,0.0,1598,4,4.0,4,3,4
78,1,33,1,1.0,2.0,1638,1,3.0,2,1,2
79,1,27,1,2.0,7.0,2612,3,4.0,3,3,3
80,1,35,2,2.0,16.0,2808,3,4.0,3,3,3
81,2,35,2,3.0,15.0,2183,3,4.0,4,3,4

In [34]:
##alsdasldsaldlmdl lassi leikkii näillä muuttujilla
df1= df[['gender', 'age']]
df1.dtypes #kertoo datan tyypin. ikä ja sukupuoli on tässä luokiteltu kokonaislukuina

164